<template>
    <div class="select-city my-container my-center">
        <citynav/>
        <hotcity/>
        <pinyin @nav="goToNav"/>
        <citylist title="A" ref='A' :city="['安庆','安阳','鞍山','阿拉善盟','安达','安顺','阿克苏','阿勒泰','阿坝州','安康']"/>
        <citylist title="B" ref='B' :city="['北京','宝鸡','包头','保定','蚌埠','亳州','巴彦','淖尔','北流','北海','本溪','巴中','滨州','博罗','保亭','白沟','保山','白城','百色','白山','毕节','白银','宝安']"/>
        <citylist title="C" ref='C' :city="['重庆','长沙','成都','长春','滁州','巢湖','长沙','常州','池州','常熟','赤峰','承德','潮州','昌吉','长治','常德','长安','常平','郴州','楚雄','沧州','长乐','朝阳']"/>
        <citylist title="D" ref='D' :city="['东莞','定州','德阳','大庆','大连','都江堰','达州','大理','大同','敦煌','东乡','丹东','东港','大丰','德州','都匀','东营','东台','丹阳','大朗','大岭山','定安','登封','邓州','大安','德惠','儋州','灯塔','东阳','定西','大石桥','大兴安岭']"/>
        <citylist title="E" ref='E' :city="['鄂尔多斯','二连浩特','峨眉山','恩平','恩施','鄂州']"/>
        <citylist title="F" ref='F' :city="['福州','阜新','阜阳','抚州','佛山','富阳','福泉','凤凰县','凤岗','丰城','肥东县','肥西县','防城港','抚顺','凤城']"/>
        <citylist title="G" ref='G' :city="['广州','贵阳','赣州','桂林','广汉','广元','贵港','固安','盖州','高明','巩义','高安','固原','甘南','藁城','公主岭','个旧']"/>
        <citylist title="H" ref='H' :city="['杭州','哈尔滨','海口','合肥','呼和浩特','淮南','惠州','淮北','葫芦岛','黄山','湖州','邯郸','淮安','呼伦贝尔','海门','鹤壁','菏泽','虎门','厚街','河源','怀化','衡阳','河间','河池','贺州','桦甸','衡水','韩城','哈密','海宁','华阴','海安','黄冈','黑河','黄石','鹤岗','海城','汉中','和田']"/>
        <citylist title="J" ref='J' :city="['济南','佳木斯','晋江','江阴','晋中','九江','吉安','景德镇','吉林','锦州','焦作','揭阳','江门','嘉兴','金华','酒泉','嘉峪关','江油','金昌','晋城','界首','建湖县','江都','姜堰','鸡西','句容','靖江','即墨','济源','胶南','济宁','井冈山','九台','晋州','蛟河','冀州','景洪','荆门','集安','荆州','建德','吉首','江山']"/>
        <citylist title="K" ref='K' :city="['昆明','昆山','开封','库尔勒','凯里','开平','克拉玛依','奎屯','喀什']"/>
        <citylist title="L" ref='L' :city="['兰州','兰溪','龙岩','临汾','聊城','莱芜','乐山','临沂','泸州','吕梁','柳州','连云港','洛阳','临夏','陇南','乐平','丽江','溧水','丽水','龙泉','乐陵','六盘水','龙口','六安','莱阳','浏阳','拉萨','龙门','醴陵','冷水江','龙华','耒阳','灵宝','娄底','廊坊','漯河','来宾区','临沧','鹿泉','临江','辽源','临安','陵水','辽阳','临海','龙岗','乐清']"/>
        <citylist title="M" ref='M' :city="['茂名','马鞍山','牡丹江','绵阳','眉山','梅州','绵竹','明光','孟州','蒙自','梅河口']"/>
        <citylist title="N" ref='N' :city="['南昌','南京','南宁','南充','宁德','南通','宁波','内江','南康','南平','南安','南海','宁国','南阳','南宫']"/>
        <citylist title="P" ref='P' :city="['盘锦','萍乡','濮阳','彭州','莆田','沛县','平凉','邳州','普兰店','蓬莱','平度','鄱阳','平顶山','攀枝花','普洱','磐石']"/>
        <citylist title="Q" ref='Q' :city="['迁安','齐齐哈尔','清远','青岛','秦皇岛','泉州','七台河','启东','青州','沁阳','曲阜','青铜峡','琼海','曲靖','钦州','潜江','衢州','庆阳']"/>
        <citylist title="R" ref='R' :city="['日照','如皋','汝州','任丘','瑞金','如东','瑞丽','仁怀','瑞安']"/>
        <citylist title="S" ref='S' :city="['上海','沈阳','石家庄','顺德','汕头','石嘴山','石狮','绍兴','上饶','三亚','苏州','深圳','宿州','绥化','宿迁','三水','寿光','韶关','三门峡','什邡','朔州','三明','四平','沭阳县','射阳县','双鸭山','绥芬河','韶山','遂宁','邵阳','三清山','四会','商丘','三河','汕尾','石龙','松原','深州','舒兰','双辽','十堰','随州','石河子','沙河','上虞','嵊州','商洛']"/>
        <citylist title="T" ref='T' :city="['天津','太原','桐城','铜陵','桐庐','泰安','唐山','通辽','太仓','铁岭','天长','天水','泰州','泰兴','铜山县','滕州','塘厦','洮南','铜川','通化','吐鲁番','桐乡','天门','铜仁','台州']"/>
        <citylist title="W" ref='W' :city="['武汉','乌鲁木齐','吴忠','万州','潍坊','威海','芜湖','无锡','乌海','乌兰','察布','武威','温州','瓦房店','文昌','乌兰浩特','文登','吴江','万宁','五指山','婺源','武夷山','文山','梧州','武安','渭南','温岭']"/>
        <citylist title="X" ref='X' :city="['西安','咸阳','厦门','宣城','襄阳','徐州','新余','兴安盟','西宁','忻州','许昌','锡林','郭勒盟','邢台','兴化','湘乡','湘潭','新乡','香格里拉','新泰','新密','新郑','萧山','西昌','信丰','新乐','信阳','荥阳','辛集','孝感','新民','兴平','仙桃','咸宁','兴城']"/>
        <citylist title="Y" ref='Y' :city="['银川','宜春','宜宾','宜昌','运城','义乌','烟台','玉林','阳江','延吉','扬州','盐城','雅安','鹰潭','云浮','榆林','阳泉','岳阳','仪征','益阳','扬中','宜兴','兖州','义马','禹州','永城','余杭','玉溪','榆树','延安','余姚','伊春','永康','盐田','营口']"/>
        <citylist title="Z" ref='Z' :city="['郑州','淄博','涿州','遵化','株洲','湛江','珠海','镇江','漳州','中山','张家港','中江','张家口','自贡','肇庆','中卫','周口','舟山','资阳','庄河','张家界','遵义','章丘','诸城','昭通','枣庄','樟树','驻马店','张掖','诸暨','镇远']"/>
    </div>
</template>


<script>
  // 选择城市
  export default {
    data() {
      return {}
    },
    mounted() {
        this.leader = 0;
        this.navTimer = null;
    },
    methods:{
        goToNav(ref){
            console.log(ref);
            const dom = this.$refs[ref].$el;
            const top = dom.getBoundingClientRect().top + this.scroll().top;
            //跳转
            clearInterval(this.navTimer);
            let leader = this.leader;
            let target = top;
            this.navTimer = setInterval(() => {
            leader = leader + (target - leader) / 10;
            if (Math.round(leader) == target) {
              leader = target;
              clearInterval(this.navTimer);
            }
            this.leader = leader;
            window.scrollTo(0, leader);
          }, 10);
        },
        scroll() {
          if (window.pageXOffset != null) {
            //最新的浏览器
            return {
              left: window.pageXOffset,
              top: window.pageYOffset
            };
          } else if (document.compatMode == "CSS1Compat") {
            //有文档声明的
            return {
              left: document.documentElement.scrollLeft,
              top: document.documentElement.scrollTop
            };
          }
          return {
            //没有文档声明的
            left: document.body.scrollLeft,
            top: document.body.scrollTop
          };
        },
    }
  }
</script>

<style lang="less" scoped>
  .select-city {
    background-color: white;
  }
</style>

